Revit 2027 API
ViewSet.Contains Method
Tests for the existence of a view within the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Contains(
	View item
)
Public Overridable Function Contains (
	item As View
) As Boolean
public:
virtual bool Contains(
	View^ item
)
abstract Contains :
        item : View -> bool
override Contains :
        item : View -> bool
Parameters
item View
The view to be searched for.
Return Value
Boolean
The Contains method returns True if the view is within the set, otherwise False.
See Also
Reference
ViewSet Class
Autodesk.Revit.DB Namespace